{
  "buttons": {
    "print": "print"
  },
  "asideBar": {
    "country": "Belarus",
    "skills": {
      "javascript": "JavaScript",
      "typescript": "TypeScript",
      "react": "React",
      "redux": "Redux",
      "html5Css3": "HTML5/CSS3",
      "jest": "Jest",
      "git": "Git"
    },
    "languages": {
      "russian": "Russian - native",
      "english": "English - intermediate"
    },
    "education": {
      "petProjects": "2020 - present: Pet projects, documentation and theory studies, IT-centric English practice, work with mentor",
      "university": "2009 - 2014: Belarusian State University of Economics"
    }
  },

  "mainInfo": {
    "highlightedWords": {
      "mySkills": "My skills:",
      "languages": "Languages:",
      "reactEcosystem": "React ecosystem:",
      "styling": "Styling:",
      "other": "Other:",
      "whyMe": "Why me:"
    },
    "aboutMaria": {
      "name": "Maria Kushlianskaya",
      "role": "Front-End Developer",
      "introduction": "I am Maria, an ambitious and highly motivated developer willing to jumpstart my career in an exciting world of web technologies.",
      "studyYears": "During the 2 years of my studies, I dedicated myself to learning JavaScript and React, and also battle-tested these skills by doing personal projects.",
      "proudProject1": "I am particularly proud of ",
      "proudProject2": ", where I successfully implemented quite complex functionalities using Typescript, React, and Redux, CSS.",
      "petProjects1": "After doing multiple pet projects (you can see them all [here] ",
      "petProjects2": "over a couple of years, I am pretty sure I am ready to start developing web apps professionally."
    },
    "skills": {
      "languages": "Languages: Javascript, Typescript",
      "reactEcosystem": "React ecosystem: React, Redux, Redux Toolkit, RTK Query, Formik, and other React libs",
      "styling": "Styling: CSS3, SCSS, Material UI, Bootstrap, a bit of Ant Design. Use CSS Flexbox and some CSS Grid to design web pages. Practice responsive design",
      "other": "Other: Know how to use Postman for backend requests, utilize Jest and React Testing Library in pet projects. Use Git CLI and know how to work with Github"
    },
    "whyMe": {
      "modularCode": "Write modular code with low coupling",
      "componentDesign": "Understand the principles of component design",
      "mappers": "Use mappers to decouple frontend data from backend specifics",
      "structure": "Always think about application structure and how my changes will affect it",
      "workflow": "Work on my pet projects using Jira, decomposing tasks and creating PRs to be reviewed by the mentor",
      "learnTech": "Learn technologies by reading documentation in English as it is the best source of information"
    },
      "currentProject": "For now, I am working on my personal website. It will be responsive, and I am planning to use TypeScript, React, Redux, and Next.js.",
      "futurePlans": "There’s still a lot to learn, of course! As for technologies, my plans include new CSS stuff like container queries and layers, as well as Storybook, Redux Saga, Styled Components, GraphQL, PWAs, and more. I will continue working to increase my English language level. Long term, I am also interested in people and resource management.",
      "eagerToWork": "I am eager to work alongside experienced developers who can mentor and guide me towards becoming a proficient frontend developer.",
      "contribution": "In my opinion, modern web technologies, together with AI, are what push successful businesses forward, and I want to help companies drive this effort."


  }
}
