{
  "buttons": {
    "print": "печать"
  },
  "asideBar": {
    "country": "Буларусь",
    "skills": {
      "javascript": "JavaScript",
      "typescript": "TypeScript",
      "react": "React",
      "redux": "Redux",
      "html5Css3": "HTML5/CSS3",
      "jest": "Jest",
      "git": "Git"
    },
    "languages": {
      "russian": "Русский - родной",
      "english": "Английский - средний уровень"
    },
    "education": {
      "petProjects": "2020 - настоящее время: Личные проекты, изучение теории и документации, английская практика в IT, работа с наставником",
      "university": "2009 - 2014: Белорусский государственный университет экономики"
    }
  },
  "mainInfo": {
    "highlightedWords": {
      "mySkills": "Навыки:",
      "languages": "Языки:",
      "reactEcosystem": "React экосистема:",
      "styling": "Стили:",
      "other": "Другое:",
      "whyMe": "Почему я:"
    },
    "aboutMaria": {
      "name": "Мария Кушлянская",
      "role": "Фронтенд-разработчик",
      "introduction": "Я Мария, амбициозный и высокомотивированный разработчик, готовый начать свою карьеру в захватывающем мире веб-технологий.",
      "studyYears": "В течение 2 лет я изучаю JavaScript и React, а также отточила свои навыки, выполняя персональные проекты.",
      "proudProject1": "Особенно горжусь приложением",
      "proudProject2": ", где я успешно реализовала довольно сложные функциональности, используя TypeScript, React и Redux, CSS.",
      "petProjects1": "После выполнения нескольких персональных проектов (вы можете увидеть их все [здесь]",
      "petProjects2":"за несколько лет, я уверена, что готова начать профессиональное развитие в веб-разработке."
    },
    "skills": {
        "languages": "Языки: Javascript, Typescript",
        "reactEcosystem": "Экосистема React: React, Redux, Redux Toolkit, RTK Query, Formik и другие библиотеки React",
        "styling": "Оформление: CSS3, SCSS, Material UI, Bootstrap, немного Ant Design. Использую CSS Flexbox и некоторые элементы CSS Grid для проектирования веб-страниц. Практикую отзывчивый дизайн",
        "other": "Другие навыки: Знаю, как использовать Postman для запросов к бэкэнду, использую Jest и React Testing Library в своих проектах. Использую Git CLI и знаю, как работать с Github"
    },
    "whyMe": {
      "modularCode": "Пишу модульный код с низкой связанностью",
      "componentDesign": "Понимаю принципы проектирования компонентов",
      "mappers": "Использую мапперы для разделения данных фронтенда от специфики бэкенда",
      "structure": "Всегда думаю о структуре приложения и о том, как мои изменения повлияют на нее",
      "workflow": "Работаю над своими проектами с использованием Jira, разбиваю задачи и создаю Pull Requests для рецензии наставника",
      "learnTech": "Изучаю технологии, читая документацию на английском, так как это лучший источник информации"
    },
    "currentProject": "На данный момент я работаю над своим персональным веб-сайтом. Он будет адаптивным, и я планирую использовать TypeScript, React, Redux и Next.js.",
    "futurePlans": "Конечно, еще многое предстоит узнать! Что касается технологий, в моих планах изучение новых возможностей CSS, таких как container queries и layers, а также Storybook, Redux Saga, Styled Components, GraphQL, PWAs и многое другое. Я буду продолжать работу над улучшением своего уровня английского языка. В долгосрочной перспективе меня также интересует управление людьми и ресурсами.",
    "eagerToWork": "С нетерпением готова работать рядом с опытными разработчиками, которые смогут наставлять и направлять меня на пути к профессиональному фронтенд-разработчику.",
    "contribution": "На мой взгляд, современные веб-технологии, вместе с искусственным интеллектом, толкают успешные бизнесы вперед, и я хочу помочь компаниям развиваться в этом направлении."
  }
}
